{"echelon": "A level, rank or grade; the people at that level", "augury": "Telling the future, such as through supernatural means", "indigence": "Extreme poverty", "abreast": "Side-by-side. The more common \"abreast of\" means keeping up with, staying aware of, or remaining equal in progress with.", "coagulate": "Cause a liquid to become solid or semisolid", "declaim": "Speak in an impassioned, pompous, or oratorical manner; give a formal speech", "pungent": "Having a sharp taste or smell; biting, stimulating, sharp", "diurnal": "Occurring every day; happening in the daytime (rather than at night)", "interplay": "Interaction, reciprocal relationship or influence", "graft": "Insert part of a plant into another plant, where it continues to grow; join living tissue (such as skin) to part of the body where it will continue to live and grow; attach as if by grafting (verb); the part so grafted (as in a graft of skin); the act of acquiring money or other benefits through illegal means, esp. by abusing one's power (noun)", "vociferous": "Noisily crying out, as in protest", "doff": "Take off (such as clothes), put aside; remove one's hat as a gesture", "edify": "Uplift, enlighten, instruct or improve in a spiritual or moral way", "jingoism": "Excessive, loud patriotism and aggressive, warlike foreign policy", "ardent": "Very passionate, devoted, or enthusiastic", "apostate": "Person who deserts a party, cause, religion, etc.", "endemic": "Native, local; natural, specific to, or confined to a particular place", "delimit": "Fix, mark, or define the boundaries of", "ford": "Place where a river or similar body of water is shallow enough to walk or ride a vehicle across (noun); to cross at such a place (verb)", "contumacious": "Rebellious; stubbornly disobedient", "infallible": "Incapable of error; certain", "pusillanimous": "Cowardly, timid", "epicure": "Person with cultivated, refined tastes, esp. in food and wine", "vestige": "Trace or sign of something that once existed", "beneficent": "Doing good", "aspersions": "Damaging remarks, defamation, slander", "token": "Sign, symbol, mark, badge; souvenir, memento; coin-like disk used as currency for subways, arcade games, etc.; sample, or person, thing, idea taken to represent an entire group (noun); of very little or merely symbolic value (adj)", "dilatory": "Slow, late; procrastinating or stalling for time", "nadir": "Lowest point", "axiom": "Self-evident truth requiring no proof; universally or generally accepted principle", "terse": "Concise, brief and to the point (sometimes to the point of rudeness)", "effigy": "Representation or image of a person, esp. a crude facsimile used to mock a hated person", "ethos": "The character, personality, or moral values specific to a person, group, time period, etc.", "garner": "Gather and store; amass, collect", "dither": "Act indecisively (verb); a state of fear or trembling excitement", "coffer": "Chest for storing valuables; financial resources, a treasury", "peddle": "Travel around while selling; sell illegally; give out or disseminate", "equanimity": "Composure, evenness of mind; mental or emotional stability, esp. under stress", "munificent": "Generous, giving liberally", "impious": "Not religious, lacking reverence, ungodly", "brandish": "Shake, wave, or flourish, as a weapon", "forestall": "Delay, hinder, prevent by taking action beforehand", "normative": "Implying or attempting to establish a norm; expressing value judgments or telling people what to do (rather than merely describing that which is happening)", "primacy": "The state of being first or most important", "immutable": "Unchangeable", "supposition": "Assumption, hypothesis, something that has been supposed", "redound": "To have a good or bad effect, esp. as a result of a person's efforts or actions (usually used with to, on, or upon)", "dyspeptic": "Grumpy, pessimistic, irritable; suffering from dyspepsia (indigestion)", "apprise": "Inform, give notice to", "recapitulate": "Summarize, repeat in a concise way", "truculent": "Fierce, cruel, savage; belligerent", "bonhomie": "Friendliness, open and simple good heartedness", "cupidity": "Greed, great or excessive desire", "faction": "Group or clique within a larger organization; party strife and dissension", "pastiche": "Mix of incongruous parts; artistic work imitating the work of other artists, often satirically", "rarefied": "Lofty, very high up or elevated (in a metaphorical way); exclusive, select; thin, pure, or less dense (as air at the top of a mountain)", "impermeable": "Impassable, not allowing passage through (such as by a liquid)", "ossify": "Become bone or become hard like bone; become inflexible in attitudes, opinions, etc.", "palliate": "Make less serious or severe; relieve symptoms of an illness", "bilk": "Cheat or defraud", "resurgent": "Having a revival, renewing, rising or surging again", "inquest": "Legal or judicial inquiry, especially before a jury and especially made by a coroner into the cause of someone's death; the results of such an inquiry", "hand-wringing": "Grasping, squeezing, etc. of the hands as an expression of nervousness, guilt, etc.; extend debate over what to do about an issue", "grievous": "Causing grief or suffering; very serious, grave; flagrant, outrageous", "imbue": "Permeate or saturate, as dye in a fabric; influence throughout", "symbiosis": "Mutually dependent relationship between two organisms, people, groups, etc.", "grandstand": "Perform showily in an attempt to impress onlookers", "ostensible or ostensive": "Professed, evident, or pretended; outwardly appearing in a certain way", "august": "Venerable, majestic; inspiring admiration", "inordinate": "Excessive, not within proper limits, unrestrained", "vicissitude": "Changes or variations over time, esp. regular changes from one thing to another", "harrow": "Farming tool that breaks up soil (noun); painfully disturb or distress (verb)", "insensible": "Incapable of feeling; unconscious, unaware", "posit": "Presume, suggest, put forward (an idea)", "maxim": "A general truth or fundamental principle, esp. expressed as a proverb or saying", "insular": "Pertaining to an island; detached, standing alone; narrow-minded, provincial", "surrogate": "Substitute, person who acts for another (noun); acting as a replacement (adj)", "luminous": "Shining, radiant, well-lit; brilliant or enlightening", "orotund": "Full, rich, and clear (of the voice or speaking); pompous, bombastic", "mired": "Stuck, entangled (in something, like a swamp or muddy area), soiled", "hapless": "Unlucky, unfortunate", "tawdry": "Gaudy, cheap or cheap-looking; indecent", "proclivity": "Inclination, natural tendency", "lurid": "Gruesome or excessively vivid; sensational, shocking, unrestrained", "platitude": "A shallow, overused statement; cliche", "investiture": "Investing; formally giving someone a right or title", "apposite": "Highly appropriate, suitable, or relevant", "malediction": "A curse", "squelch": "Crush, squash; suppress or silence; walk through ooze or in wet shoes, making a smacking or sucking sound", "somatic": "Of the body", "insinuate": "Hint, suggest slyly; introduce (an idea) into someone's mind in a subtle, artful way", "implacable": "Not able to be appeased, calmed, or satisfied", "ameliorate": "Improve; make better or more bearable", "hoary": "Very old, gray or white as from old age", "albeit": "Although, even though", "verisimilar": "Having the appearance of truth, probable", "fracas": "Noisy disturbance or fight; brawl", "obdurate": "Stubborn, hardhearted, hardened in wrongdoing", "knell": "The sound made by a bell for a funeral, or any sad sound or signal of a failure, death, ending, etc. (noun); to make such a sound (verb)", "declivity": "Downward slope", "cloying": "Disgustingly or distastefully sweet", "semantic": "Relating to the different meanings of words or other symbols", "revamp": "Renovate, redo, revise (verb); a restructuring, upgrade, etc. (noun)", "grovel": "Creep or crawl with one's face to the ground, prostrate oneself as a token of subservience, degrade or abase oneself", "blithe": "Joyous, merry; excessively carefree (so as to ignore more important concerns)", "raconteur": "Witty storyteller", "acumen": "Keen, quick, accurate insight or judgment", "modish": "Stylish, contemporary", "florid": "Reddish or rosy; flowery, showy, or excessively fancy", "ersatz": "Artificial, synthetic; being an inferior substitute", "collude": "Conspire; cooperate for illegal or fraudulent purposes", "hallmark": "A mark indicating quality, purity, genuineness, etc.; any distinguishing characteristic", "impasse": "Position or road from which there is no escape; deadlock", "blight": "Disease that kills plants rapidly, or any cause of decay or destruction (noun); ruin or cause to wither (verb)", "prescient": "Having foreknowledge or foresight, seeing the future", "adulterate": "Make impure by adding inappropriate or inferior ingredients", "cardinal": "Chief, most important", "dissolution": "Dissolving, the state of having been dissolved; breaking bonds or breaking up of a group of people; death, disintegration; sinking into extreme hedonism, vice, and degradation", "prattle": "Talk in an idle, simple-minded, meaningless, or foolish way; chatter, babble", "monastic": "Relating to or resembling a monastery (where monks or nuns live), esp. by being quiet, secluded, contemplative, strict, and/or lacking luxuries", "querulous": "Given to complaining, grumbling", "disparage": "Belittle, put down; bring shame upon, discredit", "tendentious": "Marked by a strong point of view, biased", "demur": "Show reluctance or object, especially for moral reasons", "balloon": "Swell or puff out; increase rapidly", "refractory": "Stubbornly disobedient, hard to manage", "gouge": "Scooping or digging tool, like a chisel, or a hole made with such a tool (noun); cut or scoop out; force out a person's eye with one's thumb; swindle, extort money from (verb)", "egress": "An exit or the action of exiting", "impute": "Credit, attribute; lay blame or responsibility for (sometimes falsely)", "irresolute": "Wavering, not sure how to proceed, not firm in one's decision-making", "tortuous": "Twisting, winding, complex; devious, not straightforward", "juxtapose": "Place side by side (either physically or in a metaphorical way, such as to make a comparison)", "approbation": "Praise or approval, especially formal approval", "bifurcate": "To fork into two branches or divide into two halves", "hew": "Strike, chop, or hack (as with an axe, sword. etc.); make or shape something (such as a statue) with a cutting tool", "itinerant": "Traveling from place to place, esp. as part of a job", "apostle": "Pioneer of a reform movement (originally, an early follower of Jesus)", "grouse": "Complain or grumble (verb); a reason for complaint (noun)", "hegemony": "Domination, authority; influence by one country over others socially, culturally, economically, etc.", "coda": "Final part of a musical composition; an ending, esp. one that sums up what has come before", "complaisant": "Eager to please; cheerfully complying", "vex": "annoy or bother; puzzle or distress", "panoply": "Splendid, wide-ranging, impressive display or array", "rue": "Regret, remorse (noun); to feel regret or remorse (verb)", "iniquity": "Injustice, wickedness, sin", "hotly": "In an intense, fiery, or heated way", "hedge": "Avoid commitment by leaving provisions for withdrawal or changing one's mind; protect a bet by also betting on the other side", "felicitous": "Admirably appropriate, very well-suited for the occasion; pleasant, fortunate, marked by happiness", "sinecure": "A job or position that pays while requiring little or no work", "martinet": "Person who adheres to rules extremely closely; strict disciplinarian", "grating": "Irritating; harsh or discordant (of a noise); scraping", "nominal": "Trivial, so small as to be unimportant; in name only, so-called", "repose": "The act or state of resting; peacefulness, tranquility; lying dead in a grave", "incarnadine": "Blood red or flesh-colored", "livid": "Furiously angry, enraged", "quiescent": "Quiet, still", "appropriate": "Set aside or authorize (such as money) for a particular purpose; take for one's own use", "exonerate": "Clear from blame or accusation; free from a responsibility", "gestation": "Pregnancy; the period from conception until birth of an animal or (metaphorically) of an idea or plan", "lionize": "Treat like a celebrity", "cosset": "Treat as a pet, pamper", "imprecation": "Curse; prayer for harm to come to someone", "predilection": "Preference, tendency or favorability towards", "impassive": "Not having or not showing physical feeling or emotion", "polyglot": "Speaking or composed of many languages (of a person, book, etc.); a person who knows several languages", "preternatural": "Supernatural, exceptional", "untempered": "Not toned down; not moderated, controlled, or counterbalanced", "itinerary": "Travel schedule; detailed plan for a journey", "occlude": "Stop up, close, shut in or shut off", "glower": "Stare in an angry, sullen way", "compendium": "Concise but complete summary; a list or collection", "propensity": "Natural inclination or tendency", "inimical": "Hostile, adverse, harmful", "myopic": "Near-sighted; lacking long-term thinking, short-sighted", "furtive": "Done secretly; stealthy, sly, shifty", "philistine": "Person deficient in or hostile to culture", "antithetical": "Directly opposed, opposite; involving antithesis (the rhetorical act of placing two phrases opposite one another for contrast, as in love me or hate me)", "abscond": "Depart suddenly and secretively", "abscission": "Cutting off; sudden termination; the separation of leaves, petals, or other parts from a plant or animal", "opprobrium": "Disgrace and disapproval that result from outrageously shameful actions", "besiege": "Attack, overwhelm, crowd in on or surround", "inexorable": "Relentless, unyielding; not moved by pleading", "solidarity": "Fellowship in interests, feelings, responsibilities, etc., such as among a group of people or among classes, nations, etc.", "acidulous": "Slightly acid or sour; sharp or caustic", "maudlin": "Excessively sentimental, showing sadness or some other emotion in a foolish or silly way", "variegated": "Varied in color, having multicolored patches or spots; diverse", "peregrinate": "Travel from place to place, esp. on foot", "metaphysical": "Concerned with abstract thought, related to metaphysics (branch of philosophy concerned with explaining the nature of being and of the world); very subtle or abstruse", "parley": "Discussion, negotiation, esp. between enemies (noun); to have such a discussion (verb)", "bevy": "Group of birds or other animals that stay close together; any large group", "ignoble": "Not noble; having mean, base, low motives; low quality", "panache": "Flair, style, swagger; a flamboyant or grand way of acting", "invective": "Violent denunciation; accusations, insults, or verbal abuse", "plutocracy": "Rule by the wealthy", "catholic": "Universal, broad-minded", "mar": "Damage, spoil, ruin", "scurvy": "Contemptible, mean", "doctrinaire": "Person who applies doctrine in an impractical or rigid and close-minded way (noun); merely theoretical, impractical, or fanatical about other people accepting one's ideas (adj)", "duplicity": "Deceit, double-dealing, acting in two different ways for the purpose of deception", "intransigent": "Refusing to compromise, inflexible, having extreme attitudes", "invidious": "Hateful, offensive, injurious", "inter": "Bury (a dead body) or place in a tomb", "unsparing": "Generous, lavish (as in not sparing any help or gifts to others); unmerciful, harsh (as in not sparing any criticism)", "amortize": "Gradually pay off a debt, or gradually write off an asset", "glacial": "Pertaining to glaciers; cold, icy, slow, unsympathetic", "forage": "Wander in search of; rummage, hunt, make a raid", "travesty": "Exaggerated, debased, or grotesque imitation", "inconstancy": "Fickleness, unreliability; the state of changing without good reason", "baying": "Howling in a deep way, like a dog or wolf", "burnish": "Polish, make smooth and lustrous", "pallid": "Abnormally pale (as skin); lacking color or vitality", "arrogate": "Take or claim (something) for oneself without justification", "diffident": "Lacking confidence, shy", "abeyance": "Temporary suspension, inactivity", "anachronism": "Something that is not in its correct historical time; a mistake in chronology, such as by assigning a person or event to the wrong time period", "recondite": "Not easily understood, hidden, dealing with an obscure topic", "fallow": "Left unplanted (of land); not in use", "dupe": "Person who is easily fooled or used (noun); to fool or exploit (verb)", "tumultuous": "Riotous, violently agitated, marked by disturbance or uproar; noisy, chaotic", "acerbic": "Sour; harsh or severe", "erstwhile": "Former, previous (adj); in the past, formerly (adv)", "abase": "Degrade or humble; to lower in rank, status, or esteem", "lax": "Not strict; careless, loose, slack", "morose": "Gloomy, sullen", "fortuitous": "Happening by chance; lucky", "per se": "Intrinsically; by itself; in itself", "seraphic": "Like an angel; serene, spiritually carried off or transported", "modicum": "A little bit or limited quantity", "whet": "Stimulate, make keen or eager (esp. of an appetite)", "lachrymose": "Tearful, mournful", "disparate": "Distinct, different", "effrontery": "Shameless; Boldness", "multifarious": "Diverse, having a lot of variety", "curmudgeon": "Bad-tempered, difficult person; grouch", "viscid or viscous": "Thick, adhesive, or covered in something sticky", "synoptic": "Relating to a synopsis or summary; giving a general view", "ascribe": "Assign or credit to a certain cause or source", "neophyte": "Beginner, novice; person newly converted to a religion", "idyllic": "Presenting a positive, peaceful view of rural life (as poetry or prose); pleasant in a natural, simple way", "inert": "Inactive; having little or no power to move", "subpoena": "A court order requiring a person to appear in court and give testimony", "plebeian": "Of the common people", "magnanimous": "High-minded, noble, lofty; generous in forgiving others, free of resentment", "diffuse": "Spread widely, disseminate (verb); dispersed, widely spread out, or wordy and going off-topic (adj)", "fulminate": "Explode, detonate; attack verbally in a vehement, thunderous way", "listless": "Spiritless, lacking interest or energy", "assail": "Attack violently, assault", "nettle": "Irritate, sting, or annoy", "xenophobia": "Fear or hatred of foreigners or that which is foreign", "inure": "Toughen up; accustom or habituate to pain, hardship, etc.", "indefatigable": "Untiring, not able to become fatigued", "latent": "Potential; existing but not visible or active", "anodyne": "Medicine that relieves pain (noun); soothing, relieving pain (adj)", "palatial": "Suitable for or resembling a palace, magnificent", "desultory": "Lacking consistency or order, disconnected, sporadic; going off topic", "stigma": "Mark of disgrace, a figurative stain or mark on someone's reputation", "discordant": "Harsh or inharmonious in sound; disagreeing, incongruous", "kindle": "Ignite, cause to begin burning; incite, arouse, inflame", "via": "Through, by means of, by way of (by a route that goes through or touches)", "fetid": "Stinking; having an offensive smell", "mendicant": "Beggar, or religious follower who lives by begging", "euphony": "Pleasing or sweet sound, especially as formed by a harmonious use of words", "quixotic": "Extremely impractical but very romantic, chivalrous, or idealistic; impulsive", "repast": "A meal (noun); to eat or feast (verb)", "clamber": "Climb awkwardly or with difficulty, scramble", "unconscionable": "Not guided by conscience; morally wrong, unjust, unreasonable", "adumbrate": "Give a rough outline of; foreshadow; reveal only partially; obscure", "dilettante": "Person who takes up an art or activity for amusement only or in a superficial way", "ridden": "Dominated or burdened by", "vitriol": "Something highly caustic, such as criticism (literally, one of a number of chemicals including sulfuric acid)", "oblique": "Slanting or sloping; indirect, misleading, or evasive", "neologism": "New word or phrase (or a new meaning applied to an existing word or phrase)", "demagogue": "A leader who lies and gains power by arousing the passions and especially prejudices of the people", "fractious": "Unruly, troublemaking; irritable", "hoodwink": "Trick, deceive", "impetuous": "Passionately impulsive, marked by sudden, hasty emotion; forceful, violent", "confound": "Confuse, frustrate; mix up or make worse", "aerie": "Dwelling or fortress built on a high place; the nest of a bird of prey, such as an eagle or hawk, built on a mountain or cliff", "pellucid": "Transparent, translucent; clear, easy to understand", "usury": "Charging interest on a loan, esp. charging illegally high or excessive interest", "lumber": "Walk in a heavy or clumsy way, sometimes due to being weighed down", "sardonic": "Scornfully or ironically mocking, cynically derisive", "dirge": "A funeral or mourning song or poem", "virulent": "Extremely infectious, poisonous, etc.; hateful, bitterly hostile", "wan": "Unnaturally pale, or showing some other indication of sickness, unhappiness, etc.; weak, lacking forcefulness", "puissance": "Power, might", "peripatetic": "Journeying from place to place; traveling on foot", "accede": "Agree, give consent; assume power (usually as \"accede to\")", "aseptic": "Free from germs", "paragon": "Model of excellence, perfect example", "pathogenic": "Capable of producing disease", "reactant": "Something that reacts; a substance that undergoes a change in a chemical reaction", "harangue": "Long, intense verbal attack, esp. when delivered publicly", "rococo": "Very elaborate and ornate (in decorating or metaphorically, as in speech and writing); relating to a highly ornate style of art and architecture in 18th-century France", "ribald": "Using or relating to obscene or vulgar humor", "ruminate": "Turn over in the mind, reflect on; chew cud (as a cow)", "asperity": "Rigor, severity; harshness or sharpness of tone; roughness of surface", "impugn": "Attack the truth or integrity of", "jettison": "Discard, cast off; throw items overboard in order to lighten a ship in an emergency", "stentorian": "Very loud and powerful (generally of a human voice)", "sully": "Make dirty, stain, tarnish, defile", "propitious": "Favorable, giving good signs for the future, likely to work out; kind or forgiving", "dictum": "Formal or authoritative pronouncement; saying or proverb", "coterie": "Close or exclusive group, clique", "bane": "Something that ruins or spoils", "exigent": "Requiring immediate attention, action, or aid; excessively demanding", "turpitude": "Depravity, baseness of character, corrupt or depraved acts", "puerile": "Juvenile, immature", "opine": "Express an opinion", "analgesia": "Pain relief; inability to feel pain", "magnate": "Very important or influential person, esp. in business", "discomfiting": "Disconcerting, confusing, frustrating", "larceny": "Theft", "pernicious": "Very harmful or destructive, deadly", "limpid": "Clear, transparent; completely calm", "stipulate": "Specify; make an open demand, esp. as a condition of agreement", "euphemism": "Substitution of a mild, inoffensive, or indirect expression for one that is considered offensive or too direct", "prolix": "Excessively long and wordy (of a person, piece of writing, etc.)", "penitent": "Regretful, feeling remorse for one's sins or misdeeds (adj); a person who feels this way (noun)", "pugilism": "boxing, fighting with the fists", "refulgent": "Shining, radiant", "pejorative": "Disparaging, derogatory, belittling (adj); a name or word that is disparaging (noun)", "wanton": "Reckless, vicious, without regard for what is right; unjustifiable, deliberately done for no reason at all; sexually unrestrained or excessively luxurious", "accretion": "Gradual increase; an added part or addition", "whitewash": "A substance used to whiten walls, wood, etc. (noun); deception, covering up of wrongs, errors, misdeeds, etc. (verb)", "licentious": "Sexually unrestrained; immoral; ignoring the rules", "bombastic": "(Of speech or writing) far too showy or dramatic than is appropriate; pretentious", "plethora": "Excess; excessive amount", "penury": "Extreme poverty or scarcity", "solecism": "Nonstandard use of grammar or words; mistake, esp. in etiquette", "panegyric": "Formal or lofty expression of praise", "dovetail": "Join or fit together", "providential": "Lucky, fortunate, or relating to divine care (the idea that a deity has helped or cared for a person)", "mannered": "Having a particular manner, esp. an artificial one", "contraries": "Things that are opposing; either of two opposite things", "rend": "Tear violently, esp. to tear one's clothing or hair out of grief; pull apart, split, or tear away", "tyro": "Beginner", "canard": "Rumor, a false or baseless story", "trenchant": "forceful or vigorous, effective, keen; caustic, sharp", "recrudescent": "Revival, breaking out into renewed activity", "stratagem": "Military maneuver to deceive or surprise; crafty scheme", "parry": "Deflect or avoid (esp. a blow or attack); skillfully evade (a question)", "diaphanous": "Very sheer, fine, translucent", "halcyon": "Calm and peaceful, carefree; prosperous, successful, happy", "welter": "Confused mass or pile, jumble; confusion or turmoil (noun); roll around, wallow, toss about, writhe (verb)", "gambol": "Frolic; skip or leap playfully", "lugubrious": "Mournful, gloomy (sometimes in an exaggerated way)", "nontrivial": "Important or big enough to matter", "attuned": "In harmony; in sympathetic relationship", "surly": "Bad-tempered, hostile, unfriendly, or rude", "contrite": "Remorseful; feeling sorry for one's offenses or sins", "fluke": "Stroke of luck, something accidentally successful", "ebullient": "Very enthusiastic, lively, excited; bubbling as though being boiled", "hermetic": "Airtight, sealed, isolated; reclusive; pertaining to alchemy, occult", "extemporaneous": "Done without preparation (esp. of a speech), or with some preparation but no notes; improvised, done on the spur of the moment", "shard": "Fragment of some brittle substance, esp. a sharp fragment of pottery, glass, etc.", "homage": "Honor or respect demonstrated publicly", "goad": "Urge on (as cattle) with a pointed or electrically charged stick; spur on, stimulate, encourage", "précis": "Concise summary, abstract", "turgid": "Swollen, inflated; or, metaphorically \"inflated,\" such as in overblown, pompous speech", "circumspect": "Cautious, prudent; careful to consider the circumstances and consequences", "largess or largesse": "Generosity, the giving of money or gifts (esp. with the implication that the giver is a bit superior to the recipient)", "antedate": "Be older than, precede in time; assign to an earlier date", "avarice": "Insatiable greed; a miserly desire to hoard wealth", "irascible": "Irritable, easily angered", "tome": "Large or scholarly book; one of the volumes in a set of several books", "militate": "Have a great effect, weigh heavily (often as militate against)", "leery": "Suspicious or wary", "voluble": "Easily fluent in regards to speech", "stint": "Period of time spent doing something, or a specific, limited amount of work (noun); to be frugal, to get by on little (verb)", "vernal": "Relating to the spring; fresh, youthful", "annul": "Make void or null, cancel, abolish (usually of laws or other established rules)", "treacherous": "Betraying trust, not faithful or trustworthy; not dependable; dangerous or deceptive", "squalid": "Disgusting, filthy, foul, extremely neglected", "grandiloquent": "Relating to lofty speech, esp. to the point of being pompous, overblown, bombastic", "emaciate": "Make abnormally thin, cause to physically waste away", "convoke": "Call together, as to a meeting", "rejoinder": "Response or reply, esp. a witty comeback", "prophetic": "Relating to prophesy, predicting, ominous", "distaff": "Female, esp. relating to the maternal side of the family; women or women's work; a staff that holds wool or flax for spinning", "engender": "Produce, give rise to, cause to exist; procreate", "imperious": "Commanding, domineering; acting like a high-ranking person; urgent", "bucolic": "Pertaining to shepherds; suggesting a peaceful and pleasant view of rural life", "droll": "Funny in an odd way", "fecund": "Fruitful, fertile; capable of abundantly producing offspring, vegetation, or creative or intellectual work", "sedition": "Inciting rebellion against a government, esp. speech or writing that does this", "dilate": "To become wider or make wider, cause to expand; to speak or write at length, elaborate upon", "imperturbable": "Calm, not able to be upset or agitated", "supplant": "Take the place of, displace, especially through sneaky tactics", "idolatry": "Idol worship; excessive or unthinking devotion or adoration", "fastidious": "Excessively particular, difficult to please; painstaking, meticulous, requiring excessive attention to detail", "reprobate": "Disreputable, unprincipled, or damned person (noun); shameless, depraved (adj)", "vim": "Pep, enthusiasm, vitality, lively spirit", "perennial": "Lasting through the years or indefinitely, enduring; recurring", "impecunious": "Poor, without money", "perfunctory": "Done superficially, without much care, or merely as routine", "amalgamate": "Blend, merge, or unite", "inundate": "Flood, cover with water, overwhelm", "pedant": "Person who pays excessive attention to book learning and rules, or who uses his or her learning to show off", "molt": "Shed or cast off, esp. to regularly shed skin, feathers, etc. (as a snake)", "redress": "Setting something right after a misdeed, compensation or relief for injury or wrongdoing (noun); correct, set right, remedy (verb)", "repertorial": "Pertaining to a repertory or repertoire, a stock of available things or a number of theatrical performances presented regularly or in sequence", "precipitate": "Cause to happen suddenly or prematurely; fling, plunge, or hurl down", "verdant": "Green, such as with vegetation, plants, grass, etc.; young and inexperienced", "syntax": "The rules governing grammar and how words join to make sentences (or how words and symbols join in writing computer code), the study of these rules, or any system or orderly arrangement", "encomium": "Warm, glowing praise, esp. a formal expression of praise", "iconoclast": "Attacker of cherished beliefs or institutions", "perspicacious": "Having penetrating insight or good discernment", "phalanx": "Formation of soldiers carrying shields close together for defense; any very close group of people", "fawn": "Show affection or try to please in the manner of a dog; try to win favor through flattery and submissive behavior", "terrestrial": "Relating to the Earth or to land; worldly", "recalcitrant": "Not obedient, resisting authority, hard to manage", "polemic": "Controversial argument, esp. one attacking a specific idea", "upbraid": "Find fault with, criticize or scold severely", "strut": "A structural support or brace", "fledgling": "A young bird that has just recently gotten its feathers, an inexperienced person (noun); new or inexperienced (adj)", "dissemble": "Mislead, conceal the truth, put on a false appearance of", "plucky": "Brave, spirited", "politic": "Shrewd, pragmatic; tactful or diplomatic", "interregnum": "A time in between two reigns or regimes during which there is no ruler; a period during which government does not function; any period of freedom from authority or break or interruption in a series", "steeped": "Immersed (in), saturated (with)", "husband": "Manage prudently, sparingly, or economically; conserve", "stratum": "One of many layers (such as in a rock formation or in the classes of a society)", "mirth": "Jollity, merriment; amusement or laughter", "proxy": "Agent, substitute, person authorized to act on behalf of another", "skittish": "Shy, fickle, uncertain, or prone to act suddenly due to nervousness; lively in a restless or excessive way", "abyss": "A deep and vast space or cavity; anything profound or infinite", "impervious": "Impenetrable, not able to be harmed or emotionally disturbed", "rift": "A gap or fissure (such as in rock), a break in friendly relations", "toady": "Someone who flatters or acts in a servile manner for self-serving reasons", "scintilla": "A tiny bit or trace", "ingrate": "Ungrateful person", "maelstrom": "Violent whirlpool; any chaotic, turbulent situation", "circumscribe": "Strictly limit a role, range of activity, or area; in math, to be constructed around so as to touch as many points as possible", "ostentatious": "Pretentious, boastful showiness", "assiduous": "Persevering, diligent, constant", "pare": "Peel or cut off the outer layer (such as peeling fruit with a knife), reduce or trim as if cutting off the outer parts", "missive": "Letter, written message", "lissome": "Flexible, supple, agile", "meretricious": "Attractive in a vulgar or flashy way, tawdry; deceptive", "recant": "Withdraw, retract, or disavow something one has previously said, esp. formally", "bent": "Personal inclination or tendency", "noisome": "Offensive, disgusting; harmful", "inveigle": "Entice, lure; get something by flattery, cleverness, or offering incentives", "searchingly": "In a searching or penetrating manner; while examining closely or probing for answers", "prevaricate": "Stray from the truth, mislead, lie", "umbrage": "Offense or annoyance (usually as take umbrage, meaning become offended or annoyed)", "distend": "Swell, expand, stretch, bloat", "yoke": "A burden or something that oppresses; a frame for attaching animals (such as oxen) to each other and to a plow or other equipment to be pulled, or a bar across a person's shoulders to help carry buckets of water, etc. (noun); to unite together or to burden (verb)", "connote": "Suggest or imply in addition to the precise, literal meaning", "malinger": "Pretend to be sick, esp. to get out of work, duties, etc.", "ingratiate": "Make an effort to gain favor with", "overwrought": "Overly nervous, agitated, or excited; too ornate, elaborate, or fussy; overdone", "pulchritude": "Physical beauty", "sybarite": "Person devoted to pleasure and luxury", "savant": "Learned person, scholar, someone admitted to membership in a scholarly field; a person with amazing mental abilities despite having a cognitive difference or disability", "indolent": "Lazy, slothful", "transgression": "Violation of a law, moral rule, order, etc.; sin", "insurrection": "Rebellion or revolt against a government or similarly established authority", "fatuous": "Foolish, silly, esp. in a smug or complacent manner", "aloof": "Distant physically or emotionally; reserved; indifferent", "elegy": "Song or poem of sorrow, esp. for a deceased person", "brook": "Suffer or tolerate", "sobriquet": "A nickname", "winnow": "Sift, analyze critically, separate the useful part from the worthless part", "slake": "Satisfy (esp. thirst), cool, or refresh; make less active", "propitiate": "Attempt to reconcile with, satisfy, or reduce the animosity of (a person who is angry, offended, etc.)", "sublime": "Lofty or elevated, inspiring reverence or awe; excellent, majestic; complete, utter", "kinetic": "Pertaining to motion", "misanthrope or misanthropist": "Hater of humankind", "machination or machinations": "Crafty schemes or plots", "flout": "Treat with disdain, contempt, or scorn (usually of rules)", "lethargic": "Lazy, drowsy, or sluggish", "insipid": "Dull, stale, lacking taste or interest", "banal": "Lacking freshness and originality; cliché", "phlegmatic": "Apathetic, sluggish, not easily excited or made emotional", "stasis": "Equilibrium, a state of balance or inactivity, esp. caused by equal but opposing forces", "laudable": "Worthy of praise", "salient": "Obvious, standing out; projecting, protruding, jutting out", "wizened": "Withered, shriveled", "winsome": "Charming, engaging, esp. in a sweet and innocent way", "penumbra": "Outer part of a shadow from an eclipse; any surrounding region, fringe, periphery; any area where something \"sort of\" exists", "discrete": "Separate, distinct, detached, existing as individual parts", "calumny": "Malicious lie intended to hurt someone's reputation; the act of telling such lies", "inculcate": "Teach persistently, implant (an idea) in a person", "secrete": "Produce and release a substance from a cell or gland of the body for a functional purpose", "equivocate": "Use unclear language to deceive or avoid committing to a position", "attenuate": "Weaken or thin out", "vanguard": "Leading units at the front of an army; leaders in a trend or movement, people on the \"cutting edge\"; the forefront of a trend or movement", "dichotomy": "Division into two parts or into two contradictory groups"}